<a href="https://codeimmersives.com"><img src = "https://www.codeimmersives.com/wp-content/uploads/2019/09/CodeImmersives_Logo_RGB_NYC_BW.png" width = 400> </a>


<h1 align=center><font size = 5>Agenda</font></h1>

### 
<div class="alert alert-block alert-info" style="margin-top: 20px">

1.  [Review](#0)<br>
2.  [Pandas continued](#2)<br>
2.  [Exercise](#10)<br> 
3.  [Exercise](#12)<br>     
</div>
<hr>

<h2>Review</h2>

<h2>Pandas Series continued</h2>

We can sort a series by using the sort_values method.<br>
<code>
import pandas as pd
x = [27,4,14,23,33,14,22,11]
ps = pd.Series(x).sort_values(ascending = False)
ps
</code><br>
NOTE: We can use the ascending = True to sort the series in ascending order

In [730]:
import pandas as pd
x = [27,4,14,23,33,14,22,11]
ps = pd.Series(x).sort_values(ascending = False)
ps

4    33
0    27
3    23
6    22
2    14
5    14
7    11
1     4
dtype: int64

We can also sort a series using a lambda expression.  Consider the <br>
following list of strings:<br>
<code>
ps = pd.Series(['a', 'B', 'c', 'D', 'e'])
ps.sort_values(key=lambda x: x.str.lower())
ps
</code><br>
NOTE: We can use the str method to change all values in a series to a string

In [731]:
ps = pd.Series(['a', 'C', 'B', 'c', 'D', 'e'])
ps.sort_values(inplace=True, key=lambda x: x.str.lower())
print(ps)

0    a
2    B
1    C
3    c
4    D
5    e
dtype: object

<H2>Exercise</h2>
Take the following list of cities and alphabetize them and put them<br>
In the proper case:  ALBANY ---> Albany<br>

<h4>Solution</h4>

In [732]:
import pandas as pd

cities = ['PROVIDENCE', 'HARTFORD','BOSTON','ALBANY','TRENTON']
ps = pd.Series(cities).str.capitalize().sort_values()

print(ps)

3        Albany
2        Boston
1      Hartford
0    Providence
4       Trenton
dtype: object

<h4>Pandas Series.str methods</h4>
Here is a list of str methods to try:<br>
str.contains<br>
str.count<br>
str.endswith<br>
str.find<br>
str.index<br>
str.join<br>
str.get<br>
str.len<br>
str.split<br>
str.isalnum<br>

<h2> Exercise </h2> 
1) use pd.str to get a boolean matrix for which words in the series contain 'og' - use pd.str.contains <br>
2) Use pd.str.count to get the count of 'a' in the series<br>
3) Use pd.str.count to get the count of dollar signs in the series *hint* special characters need a double backslash before them ('\\') <br>  
4) Use pd.str.endswith() to see how many strings end with 't' in the series <code>  </code> <br>
5) Use pd.str.join() to join all elements in the series using a hyphen '-' to join.

Solution:

In [733]:
import numpy as np
import pandas as pd


#1
num_1 = pd.Series(['Mouse', 'dog', 'house and parrot', '23', np.NaN] )
print(num_1.str.contains('og'))
#2
num_2 = pd.Series(['A', 'B', 'Aaba', 'Baca', np.nan, 'CABA', 'cat','aardvark'] )
num_2.str.count('a')

#3
num_3 = pd.Series(['$', 'B', 'Aab$', '$$ca', 'C$B$', 'cat', 'canna$', 'findme_', 'dollarsign$', 'infinite', 'lo$'])
num_3.str.count('\\$')

# 4
num_4 = pd.Series(['bat', 'bear', 'caT', np.nan, 'lost', 'later', 'tattletale', 'tops', 'taste', 'tart', 'tango', 'taint', 'tarentino', 'tot'])
num_4.str.endswith('t').count()
# 5
num_5 = pd.Series([['lion', 'elephant', 'zebra'],
[1.1, 2.2, 3.3],
['cat', 'gerbil', 'dog'],
['cow', 4.5, 'goat'],
['duck', 'swan', 'fish', 'guppy']] )

num_5 = num_5.str.join('-')

print([num_1, num_2, num_3, num_4, num_5])

0    False
1     True
2    False
3    False
4      NaN
dtype: object
[0               Mouse
1                 dog
2    house and parrot
3                  23
4                 NaN
dtype: object, 0           A
1           B
2        Aaba
3        Baca
4         NaN
5        CABA
6         cat
7    aardvark
dtype: object, 0               $
1               B
2            Aab$
3            $$ca
4            C$B$
5             cat
6          canna$
7         findme_
8     dollarsign$
9        infinite
10            lo$
dtype: object, 0            bat
1           bear
2            caT
3            NaN
4           lost
5          later
6     tattletale
7           tops
8          taste
9           tart
10         tango
11         taint
12     tarentino
13           tot
dtype: object, 0     lion-elephant-zebra
1                     NaN
2          cat-gerbil-dog
3                     NaN
4    duck-swan-fish-guppy
dtype: object]

We can split the data in a series and unpack the results into columns<br>
<br>
<code>
cities = ['PROVIDENCE, Rhode Island', 'Harford, Connecticut','Boston, Massachusetts']
ps = pd.Series(cities).str.split(expand = True)
ps
</code><br>
NOTE: We use the expand key word argument to create the multiple columns

In [734]:
cities = ['PROVIDENCE, Rhode Island', 'Harford, Connecticut','Boston, Massachusetts']
ps = pd.Series(cities).str.split(expand = True)
ps

             0              1       2
0  PROVIDENCE,          Rhode  Island
1     Harford,    Connecticut    None
2      Boston,  Massachusetts    None

We can remove a row by dropping its index<br>
<br>
<code>
import pandas as pd
favorites = {'1st place':'Pineapple',
            '2nd place': 'Grapes',
            '3rd place': 'Granny Smith Apples',
            '4th place': 'Strawberries'}
ps = pd.Series(favorites.values(), index = favorites.keys())
new_ps = ps.drop(labels='4th place')
new_ps
</code>

In [735]:
import pandas as pd
favorites = {'1st place':'Pineapple',
            '2nd place': 'Grapes',
            '3rd place': 'Granny Smith Apples',
            '4th place': 'Strawberries'}
ps = pd.Series(favorites)
new_ps = ps.drop(labels='4th place')
new_ps

1st place              Pineapple
2nd place                 Grapes
3rd place    Granny Smith Apples
dtype: object

<h4>Pandas Series sum</h4>
We can sum up all of our values in the series<br>
<code>
import pandas as pd
data = [90,93,97,88, 89]
ps = pd.Series(data)
print(ps.sum())
</code>

In [736]:
import pandas as pd
data = [90,93,97,88, 89]
ps = pd.Series(data)
print(ps.sum())

457

### DataFrame

In [737]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [738]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [739]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [740]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [741]:
frame.loc[1]

state    Ohio
year     2001
pop       1.7
Name: 1, dtype: object

In [742]:
frame = pd.DataFrame(data, columns = ['year', 'state', 'pop', 'area'])
frame

   year   state  pop area
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

<h2> Exercise </h2>
1) Edit the states dataframe to create a new dataframe frame2 that adds a 'debt' column  <br> 
2) change the indices to be string numbers from one to six ('one', ... 'six) <br>
3) Print all the values in the years column for viewing <br>
4) Print row 'three' with all it's values using loc[] <br>
5) Use numpy's arange() function to fill the debt column frame2['debt'] with a range of numbers (Hint: you need to match the range to the number of rows in the frame for broadcasting to work).

Solution

In [743]:
import numpy as np
import pandas as pd
states = {
    'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
    'year': [2000, 2001, 2002, 2001, 2002, 2003],
    'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
}
numbers = pd.Series(['zero', 'one', 'two', 'three', 'four', 'five'])

#1
states = pd.DataFrame(states, columns=['year', 'state', 'pop', 'debt'])
print(states)

#2
states = states.set_index(numbers)
print(states)

#3
print(states['year'])

#4
print(states.loc['two'])

#5
states['debt'] = np.arange(len(states['debt'])).astype('str')
print(states)

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN
       year   state  pop debt
zero   2000    Ohio  1.5  NaN
one    2001    Ohio  1.7  NaN
two    2002    Ohio  3.6  NaN
three  2001  Nevada  2.4  NaN
four   2002  Nevada  2.9  NaN
five   2003  Nevada  3.2  NaN
zero     2000
one      2001
two      2002
three    2001
four     2002
five     2003
Name: year, dtype: int64
year     2002
state    Ohio
pop       3.6
debt      NaN
Name: two, dtype: object
       year   state  pop debt
zero   2000    Ohio  1.5    0
one    2001    Ohio  1.7    1
two    2002    Ohio  3.6    2
three  2001  Nevada  2.4    3
four   2002  Nevada  2.9    4
five   2003  Nevada  3.2    5

Now instead of an arange, say we wanted to specify the debt column manually ourselves, we can do this by creating another series and assigning the column to the series (remember how dataframes contain series).

In [744]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
states['debt'] = val
states

       year   state  pop  debt
zero   2000    Ohio  1.5   NaN
one    2001    Ohio  1.7   NaN
two    2002    Ohio  3.6  -1.2
three  2001  Nevada  2.4   NaN
four   2002  Nevada  2.9  -1.5
five   2003  Nevada  3.2  -1.7

In [745]:
states['Eastern'] = states.state == 'Ohio'
states
#del frame2['eastern']

       year   state  pop  debt  Eastern
zero   2000    Ohio  1.5   NaN     True
one    2001    Ohio  1.7   NaN     True
two    2002    Ohio  3.6  -1.2     True
three  2001  Nevada  2.4   NaN    False
four   2002  Nevada  2.9  -1.5    False
five   2003  Nevada  3.2  -1.7    False

<h2> Exercise </h2>
1) Add a western state column that reads True for western states. <br> 
2) Print the resulting table. <br>
3) Add an Eastern_Debt column that is populated with a random number from 0 to 100. Print the result. 
3) delete all western and eastern columns using del

Solution

In [746]:
import pandas as pd
import numpy as np

print(states['Eastern'])
states['Western'] = [False if state else True for state in states['Eastern']]
print(states)

states['Eastern_Debt'] = np.random.randint(0,101,size=len(states))
print(states)

del( states['Eastern_Debt'],states['Eastern'], states['Western'])
print(states)

zero      True
one       True
two       True
three    False
four     False
five     False
Name: Eastern, dtype: bool
       year   state  pop  debt  Eastern  Western
zero   2000    Ohio  1.5   NaN     True    False
one    2001    Ohio  1.7   NaN     True    False
two    2002    Ohio  3.6  -1.2     True    False
three  2001  Nevada  2.4   NaN    False     True
four   2002  Nevada  2.9  -1.5    False     True
five   2003  Nevada  3.2  -1.7    False     True
       year   state  pop  debt  Eastern  Western  Eastern_Debt
zero   2000    Ohio  1.5   NaN     True    False            54
one    2001    Ohio  1.7   NaN     True    False            33
two    2002    Ohio  3.6  -1.2     True    False             5
three  2001  Nevada  2.4   NaN    False     True            20
four   2002  Nevada  2.9  -1.5    False     True            48
five   2003  Nevada  3.2  -1.7    False     True            71
       year   state  pop  debt
zero   2000    Ohio  1.5   NaN
one    2001    Ohio  1.7   NaN
two    2002    Ohio  3.6  -1.2
three  2001  Nevada  2.4   NaN
four   2002  Nevada  2.9  -1.5
five   2003  Nevada  3.2  -1.7

<h4> Transposing </h4>

In [747]:
import pandas as pd

pop = pd.DataFrame({'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}})
print(pop)
print(pop.T)

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5
        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [748]:
frame3 = pd.DataFrame(pop)
print(frame3)
print(frame.T)

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5
          0     1     2       3       4       5
year   2000  2001  2002    2001    2002    2003
state  Ohio  Ohio  Ohio  Nevada  Nevada  Nevada
pop     1.5   1.7   3.6     2.4     2.9     3.2
area    NaN   NaN   NaN     NaN     NaN     NaN

In [749]:
data = pd.DataFrame(pop, index=[2001, 2002, 2003])
print(data.T)

        2001  2002  2003
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   NaN

In [750]:
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [751]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [752]:
print(frame3.values)
print(frame3.values.T)

[[2.4 1.7]
 [2.9 3.6]
 [nan 1.5]]
[[2.4 2.9 nan]
 [1.7 3.6 1.5]]

### Correlation and Covariance

DONT ->conda install pandas-datareader

DO: activate virtual environment and
pip install pandas-datareader

In [753]:
import pandas_datareader as pdr

price = pd.read_pickle('yahoo_price.pkl')
volume = pd.read_pickle('yahoo_volume.pkl')

import pandas_datareader.data as web
all_data = {ticker: web.get_data_yahoo(ticker)
            for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

price = pd.DataFrame({ticker: data['Adj Close']
                     for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume']
                      for ticker, data in all_data.items()})

In [754]:
returns = price.pct_change()
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

In [755]:
import yfinance as yf
aapl_df = yf.download('AAPL',start='2022-01-03',end='2022-01-19',progress=False,)
print(aapl_df)

                  Open        High         Low       Close   Adj Close  \
Date
2022-01-03  177.830002  182.880005  177.710007  182.009995  181.778397
2022-01-04  182.630005  182.940002  179.119995  179.699997  179.471344
2022-01-05  179.610001  180.169998  174.639999  174.919998  174.697418
2022-01-06  172.699997  175.300003  171.639999  172.000000  171.781143
2022-01-07  172.889999  174.139999  171.029999  172.169998  171.950928
2022-01-10  169.080002  172.500000  168.169998  172.190002  171.970901
2022-01-11  172.320007  175.179993  170.820007  175.080002  174.857224
2022-01-12  176.119995  177.179993  174.820007  175.529999  175.306641
2022-01-13  175.779999  176.619995  171.789993  172.190002  171.970901
2022-01-14  171.339996  173.779999  171.089996  173.070007  172.849792
2022-01-18  171.509995  172.539993  169.410004  169.800003  169.583939

               Volume
Date
2022-01-03  104487900
2022-01-04   99310400
2022-01-05   94537600
2022-01-06   96904000
2022-01-07   86580100
2022-01-10  106765600
2022-01-11   76138300
2022-01-12   74805200
2022-01-13   84505800
2022-01-14   80355000
2022-01-18   90956700

In [756]:
# Getting a dict of returns from a list of company code using the data as a key

import yfinance as yf
companies = ['AAPL','GOOG','IBM','MSFT']
data = {company:yf.download(company,start='2022-01-03',end='2022-01-19',progress=False) for company in companies}
print(type(data['AAPL']))

<class 'pandas.core.frame.DataFrame'>

In [757]:
from pathlib import Path  
filepath = Path('folder/subfolder/out.csv')

header = ['Close']

# rounding off the numbers and saving each to its own csv with the company code as file name
data = {company:data[company].round(1).to_csv(f'{company}.csv') for company in data}
print(data)

{'AAPL': None, 'GOOG': None, 'IBM': None, 'MSFT': None}

In [758]:
returns['MSFT'].corr(returns['IBM'])
returns['MSFT'].cov(returns['IBM'])

8.870655479703546e-05

In [759]:
returns.MSFT.corr(returns.IBM)

0.49976361144151155

In [760]:
returns.corr()
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000277  0.000107  0.000078  0.000095
GOOG  0.000107  0.000251  0.000078  0.000108
IBM   0.000078  0.000078  0.000146  0.000089
MSFT  0.000095  0.000108  0.000089  0.000215

In [761]:
returns.corrwith(returns.IBM)

AAPL    0.386817
GOOG    0.405099
IBM     1.000000
MSFT    0.499764
dtype: float64

In [762]:
returns.corrwith(volume)

AAPL   -0.075565
GOOG   -0.007067
IBM    -0.204849
MSFT   -0.092950
dtype: float64

This notebook is part of a course at www.codeimmersives.com called Data Science. If you accessed this notebook outside the course, you can get more information about this course online by clicking here.

<hr>

Copyright &copy; 2021  Code Immersives